project_2/app/controllers/engineers_controller.rb

  def tag
     @engineers = Engineer.find_tagged_with(params[:id]).paginate :per_page => 5, :page => params[:page], :order => 'name'
---
SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN engineers ON engineers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Engineer') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def index
    #@engineers = Engineer.all
    @engineers = Engineer.paginate :per_page => 5, :page => params[:page], :order => 'name'
---
SELECT * FROM "engineers" ORDER BY name LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "engineers"

  def show
       @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 1)

  def edit
       @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 3)

  def create
    @engineer = Engineer.new(params[:engineer])
    respond_to do |format|
      if @engineer.save
---
INSERT INTO "engineers" ("name", "updated_at", "resume_updated_at", "picture_content_type", "resume_file_name", "picture_file_name", "picture_updated_at", "resume_content_type", "resume_file_size", "picture_file_size", "skill_level_id", "years_of_experience", "created_at") VALUES('Dave Matthews', '2009-11-01 17:37:23', NULL, 'image/jpeg', NULL, 'smallDesert.jpg', '2009-11-01 17:37:23', NULL, NULL, 19895, 2, 2, '2009-11-01 17:37:23')

  def update
       @engineer = Engineer.find(params[:id])

       respond_to do |format|
          if @engineer.update_attributes(params[:engineer])
             flash[:notice] = 'Engineer was successfully updated.'
             if params[:resource]
                logger.info("Creating resource #{params[:resource]}")
                @resource = Resource.new(params[:resource])
                @resource.engineer = @engineer
                @resource.save!
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 4)
UPDATE "engineers" SET "picture_file_size" = 845941, "picture_file_name" = 'Desert.jpg', "picture_updated_at" = '2009-11-01 17:45:49', "picture_content_type" = 'image/jpeg', "updated_at" = '2009-11-01 17:45:50' WHERE "id" = 1
INSERT INTO "resources" ("f_file_size", "updated_at", "engineer_id", "role", "f_content_type", "f_updated_at", "created_at", "f_file_name") VALUES(845941, '2009-11-01 19:02:11', 1, 'Picture', 'image/pjpeg', '2009-11-01 19:02:11', '2009-11-01 19:02:11', 'Desert.jpg')

  def destroy
    @engineer = Engineer.find(params[:id])
    @engineer.destroy
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2)
DELETE FROM "engineers" WHERE "id" = 2

  def destroy_resource
     @resource = Engineer.resources.find(params[:id])
     @resource.destroy
---
SELECT * FROM "resources" WHERE ("resources"."id" = 1)
DELETE FROM "resources" WHERE "id" = 1