project_2/app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT * FROM "organizations"

  def destroy
    @organization = Organization.find(params[:id])
    @organization.destroy
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 1)
DELETE FROM "organizations" WHERE "id" = 1