project_2/app/controllers/projects_controller.rb

SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN engineers ON engineers.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Engineer') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
  def tag
     @projects = Project.find_tagged_with(params[:id]).paginate :per_page => 5, :page => params[:page], :order => 'name'

SELECT * FROM "projects" ORDER BY name LIMIT 5 OFFSET 0
---
  def index
    #@projects = Project.all
    @projects = Project.paginate :per_page => 5, :page => params[:page], :order => 'name'

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "updated_at", "description", "organization_id", "created_at") VALUES('Project', '2009-11-10 00:14:20', 'Project', 1, '2009-11-10 00:14:20')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 2)
UPDATE "projects" SET "description" = '', "updated_at" = '2009-11-08 16:23:32' WHERE "id" = 2
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])