project_2/app/controllers/project_assignments_controller.rb

SELECT * FROM "project_assignments" WHERE (engineer_id = '11') ORDER BY engineer_id LIMIT 5 OFFSET 0
---
  def index
    #@project_assignments = ProjectAssignment.all
    if params[:engineer_id]
       @project_assignments = ProjectAssignment.paginate :per_page => 5, :page => params[:page], :conditions => ['engineer_id = ?',params[:engineer_id]], :order => 'engineer_id'

SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 4)
---
  def show
    @project_assignment = ProjectAssignment.find(params[:id])

SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 3)
---
  def edit
    @project_assignment = ProjectAssignment.find(params[:id])

INSERT INTO "project_assignments" ("start_date", "end_date", "project_id", "updated_at", "engineer_id", "project_scope_id", "created_at") VALUES('2009-10-31', '2009-10-31', NULL, '2009-10-31 17:30:49', NULL, NULL, '2009-10-31 17:30:49')
---
  def create
    @project_assignment = ProjectAssignment.new(params[:project_assignment])

    respond_to do |format|
      if @project_assignment.save

SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 1)
UPDATE "project_assignments" SET "end_date" = '2009-11-16', "updated_at" = '2009-11-10 00:12:43' WHERE "id" = 3
---
  def update
    @project_assignment = ProjectAssignment.find(params[:id])

    respond_to do |format|
      if @project_assignment.update_attributes(params[:project_assignment])