project_2/app/controllers/resources_controller.rb

SELECT * FROM "resources" WHERE (engineer_id = '11') ORDER BY engineer_id LIMIT 5 OFFSET 0
---
  def index
     if params[:engineer_id]
       @resources = Resource.paginate :per_page => 5, :page => params[:page], :conditions => ['engineer_id = ?',params[:engineer_id]], :order => :engineer_id

SELECT * FROM "resources" WHERE ("resources"."id" = 1)
---
  def show
     @resource = Resource.find(params[:id])

SELECT * FROM "resources" WHERE ("resources"."id" = 1)
---
  def edit
     @resource = Resource.find(params[:id])

INSERT INTO "resources" ("f_file_size", "updated_at", "engineer_id", "role", "f_content_type", "f_updated_at", "created_at", "f_file_name") VALUES(NULL, '2009-11-09 22:37:10', 1, 'Another Picture', NULL, NULL, '2009-11-09 22:37:10', NULL)
---
  def create
     @resource = Resource.new(params[:resource])
     logger.info("role: " + @resource.role)
     logger.info("url: " + @resource.f.url)
     respond_to do |format|
        if @resource.save

SELECT * FROM "resources" WHERE ("resources"."id" = 17)
UPDATE "resources" SET "f_file_size" = 16101, "f_file_name" = 'smallPenguins.jpg', "f_updated_at" = '2009-11-10 21:56:17', "f_content_type" = 'image/jpeg', "updated_at" = '2009-11-10 21:56:18' WHERE "id" = 2
---
  def update
     @resource = Resource.find(params[:id])

     respond_to do |format|
        if @resource.update_attributes(params[:resource])

SELECT * FROM "resources" WHERE ("resources"."id" = 24)
DELETE FROM "resources" WHERE "id" = 24
---
  def destroy
     @resource = Resource.find(params[:id])
     @resource.destroy