project_2/app/controllers/skill_levels_controller.rb

  def index
    @skill_levels = SkillLevel.all
---
SELECT * FROM "skill_levels"