project3/app/controllers/engineers_controller.rb

  def index
    logger.info("engineer index")
    @engineers = Engineer.paginate :per_page => 5, :page => params[:page], :order => 'id'
---
SELECT * FROM "engineers" ORDER BY id LIMIT 5 OFFSET 0

  def show
    @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)

  def edit
    @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)

  def update
    @engineer = Engineer.find(params[:id])
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)

  def destroy
    @engineer = Engineer.find(params[:id])
    @engineer.destroy
---
SELECT * FROM "engineers" WHERE ("engineers"."id" = 2053932785)
DELETE FROM "engineers" WHERE "id" = 2053932785