project3/app/controllers/names_controller.rb

SELECT * FROM "names"
---
  def index
    @names = Name.all

SELECT * FROM "names" WHERE ("names"."id" = 2053932785)
---
  def show
    @name = Name.find(params[:id])

SELECT * FROM "names" WHERE ("names"."id" = 2053932785)
---
  def edit
    @name = Name.find(params[:id])

SELECT "names".id FROM "names" WHERE (fname = 'fname1' AND lname = 'fname2') LIMIT 1
---
  def update
    @name = Name.find(params[:id])

SELECT * FROM "names" WHERE ("names"."id" = 2053932785)
DELETE FROM "names" WHERE "id" = 2053932785
---
  def destroy
    @name = Name.find(params[:id])
    @name.destroy