project3/app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT * FROM "organizations"

  def show
    @organization = Organization.find(params[:id])
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 2053932785)

  def edit
    @organization = Organization.find(params[:id])
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 2053932785)

  def update
    @organization = Organization.find(params[:id])
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 2053932785)

  def destroy
    @organization = Organization.find(params[:id])
    @organization.destroy
---
SELECT * FROM "organizations" WHERE ("organizations"."id" = 2053932785)
DELETE FROM "organizations" WHERE "id" = 2053932785