project3/app/controllers/project_scopes_controller.rb

  def index
    @project_scopes = ProjectScope.all
---
SELECT * FROM "project_scopes"

  def show
    @project_scope = ProjectScope.find(params[:id])
---
SELECT * FROM "project_scopes" WHERE ("project_scopes"."id" = 2053932785)

  def edit
    @project_scope = ProjectScope.find(params[:id])
---
SELECT * FROM "project_scopes" WHERE ("project_scopes"."id" = 2053932785)

  def update
    @project_scope = ProjectScope.find(params[:id])
---
SELECT * FROM "project_scopes" WHERE ("project_scopes"."id" = 2053932785)

  def destroy
    @project_scope = ProjectScope.find(params[:id])
    @project_scope.destroy
---
SELECT * FROM "project_scopes" WHERE ("project_scopes"."id" = 2053932785)
DELETE FROM "project_scopes" WHERE "id" = 2053932785