project3/app/controllers/project_assignments_controller.rb

  def index
    if @engineer && ! @project
       @project_assignments = ProjectAssignment.find(:all, :conditions => ["engineer_id = ?",@engineer.id])
    elsif ! @engineer && @project
       @project_assignments = ProjectAssignment.find(:all, :conditions => ["project_id = ?",@project.id])
    elsif @engineer && @project
       @project_assignments = ProjectAssignment.find(:all, :conditions => ["engineer_id = ? AND project_id = ?",@engineer.id,@project.id])
    else
       @project_assignments = ProjectAssignment.find(:all)
    end

    @project_assignments = @project_assignments.paginate :per_page => 5, :page => params[:page], :order => :start_date
---
SELECT * FROM "project_assignments"

  def show
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def edit
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def update
    @project_assignment = ProjectAssignment.find(params[:id])
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)

  def destroy
    @project_assignment = ProjectAssignment.find(params[:id])
    @project_assignment.destroy
---
SELECT * FROM "project_assignments" WHERE ("project_assignments"."id" = 2053932785)
DELETE FROM "project_assignments" WHERE "id" = 2053932785