project3/app/controllers/projects_controller.rb

SELECT * FROM "projects" ORDER BY name LIMIT 5 OFFSET 0
---
  def index
    @projects = Project.paginate :per_page => 5, :page => params[:page], :order => 'name'

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
---
  def edit
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
---
  def update
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 2053932785)
DELETE FROM "projects" WHERE "id" = 2053932785
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy