project3/app/controllers/resources_controller.rb

  def index
    if @engineer
       @resources = Resource.paginate :per_page => 5, :page => params[:page], :conditions => ['engineer_id = ?',@engineer.id], :order => :engineer_id
---
SELECT * FROM "resources" ORDER BY engineer_id LIMIT 5 OFFSET 0

  def show
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def edit
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def update
    @resource = Resource.find(params[:id])
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)

  def destroy
    @resource = Resource.find(params[:id])
    @resource.destroy
---
SELECT * FROM "resources" WHERE ("resources"."id" = 2053932785)
DELETE FROM "resources" WHERE "id" = 2053932785